[
    {
        "version": "v1.8.0",
        "title": "Chatbot Inteligente Robustez & SPA",
        "date": "30 de Enero, 2026",
        "changes": [
            "feat(chatbot): respuestas humanizadas y formateo de tickets.",
            "fix(chatbot): carga dinámica en SPA (MutationObserver) y manejo de errores.",
            "refactor: arquitectura aislada en chatbot.js para mayor estabilidad.",
            "test: suite de pruebas curl y validación integral de comunicación."
        ]
    },
    {
        "version": "v1.7",
        "title": "Optimización Líquida, Transiciones Cinemáticas y Eficiencia de Assets",
        "date": "27 de Enero, 2026",
        "changes": [
            "Optimización Extrema de Assets: Reducción del avatar de 7.5MB a 14KB (WebP) logrando una carga 99.8% más rápida.",
            "Sistema de Doble Buffer de Video: Eliminación total de parpadeos negros en las transiciones del avatar (Sidebar y Teatro).",
            "Efecto Portal Cinemático: Transformación del Modo Teatro en un lobby interactivo con CTA 'Hablar con GEMA' y navegación fluida.",
            "Hardening de app-run.sh: Implementación de validación de identidad robusta, colores ANSI y gestión dinámica de puertos.",
            "Protocolo de Versionado Total: Automatización de la sincronización entre Project, Changelog y README para consistencia absoluta.",
            "Limpieza y Saneamiento: Eliminación de residuos temporales y optimización de flujos de generación interna."
        ]
    },
    {
        "version": "v1.6",
        "title": "Arquitectura Dinámica, Navegación Minimalista y Excelencia Documental",
        "date": "26 de Enero, 2026",
        "changes": [
            "Arquitectura de 3 Capas: Implementación de la imagen maestra 'Ciclo de Vida GEMA' (Ronda 5) con lógica de bifurcación IA (Gemini AI) y Responder.",
            "Navegación Minimalista: Simplificación del sidebar a Nivel 1 para máxima estabilidad y eliminación de conflictos de eventos.",
            "Motor de Resolución de Slugs: Sincronización absoluta entre URLs, IDs de contenido y resaltado visual en el sidebar.",
            "Unificación de Fuente de Verdad: Eliminación total de versiones hardcodeadas; el proyecto ahora se autogestiona desde el Changelog.",
            "Dinamismo PDF: Implementación de timestamps anti-caché y nomenclatura estandarizada [Proyecto]_[Versión]_[Entregable]_[TS].",
            "Excelencia Editorial: Rediseño del 'Protocolo de Mejora Continua' con hipervínculos funcionales y optimización de fuentes académicas (16pt/13pt/10pt).",
            "Sincronización de Datos: Corrección masiva de claves (src -> link) y soporte dual en el motor de renderizado SPA.",
            "Automatización Cronológica: Actualización dinámica de fechas en entregables directamente desde el script de generación."
        ]
    },
    {
        "version": "v1.5",
        "title": "Ecosistema SPA, Excelencia Editorial e Inmersión GEMA",
        "date": "24 de Enero (Noche), 2026",
        "changes": [
            "Arquitectura SPA Premium: Transición total a Single Page Application con ruteo dinámico fluido.",
            "Modo Teatro GEMA: Experiencia inmersiva en primer plano con ciclo infinito de animaciones IA (gema-00 a gema-05).",
            "Excelencia Editorial PDF: Restauración de la Integridad de Contenidos (Regla de Oro) y layout premium de Entregables.",
            "Identidad Unificada: Consolidación del branding dtic-GEMA y personalización académica avanzada.",
            "Visor de Changelog Interactivo: Restauración de la transparencia técnica mediante acceso directo al historial desde la UI.",
            "Optimización de Entregables: Compactación de Fase 1 (one-sheet), inyección de URL viva y galería balanceada.",
            "Protocolo de Memoria v1.5.2: Sistematización del rastro histórico aditivo y seguro."
        ]
    },
    {
        "version": "v1.4",
        "title": "Evolución Estructural, Identidad y Entregables Dinámicos",
        "date": "24 de Enero, 2026",
        "changes": [
            "Reingeniería del Sidebar: Arquitectura modular de 3 bloques (Header, Nav, Footer).",
            "Navegación Inteligente: Ruteo proactivo y numeración dinámica automática (Padre <=> Hijo).",
            "Identidad Facultad X: Desvinculación institucional y personalización del branding global.",
            "Restauración de Avatar Premium: Recuperación del video interactivo GEMA dinámico.",
            "Motor de Entregables Dinámicos: Generación en tiempo real de PDF Fase 1 y 2 con estética académica clásica e inyección de avatar.",
            "Registro de Protocolos de Agente: Implementación de comandos OK versiona, OK guarda y flujo de memoria técnica.",
            "Saneamiento de Repositorio: Consolidación de historial en ZIP y eliminación de redundancias técnicas."
        ]
    },
    {
        "version": "v1.3",
        "title": "UX Premium, PDF y Memoria Histórica",
        "date": "24 (mediodía) de Enero, 2026",
        "changes": [
            "Implementación de Numeración Dinámica Inteligente (Menú <=> Contenidos).",
            "Navegación Proactiva: Redirección automática al primer hijo en categorías padre.",
            "Arquitectura de Sidebar Flex-3-Bloques con Sticky Footer y Scroll Independiente.",
            "Integración de Sistema de Exportación PDF (html2pdf.js) en todos los reportes.",
            "Optimización GEMA: Debouncing de animaciones (400ms) y Avatar premium (100px).",
            "Protocolo de Memoria Técnica organizado por Versiones (data/memoria/vX.Y/)."
        ]
    },
    {
        "version": "v1.2",
        "title": "Arquitectura de Datos Dinámica",
        "date": "24 de Enero, 2026",
        "changes": [
            "Externalización del historial de versiones a un archivo JSON independiente.",
            "Implementación de carga asíncrona (Fetch API) para mayor eficiencia.",
            "Optimización del sistema de navegación global dinámico.",
            "Detección automática de la versión más reciente desde el JSON.",
            "Sistema de cache-busting dinámico para garantizar datos frescos.",
            "Mejora en la mantenibilidad del portal dtic-GEMA."
        ]
    },
    {
        "version": "v1.1",
        "title": "Unificación y Optimización",
        "date": "23 de Enero, 2026",
        "changes": [
            "Unificación de portales (Chatbot + Entregables).",
            "Sistema de navegación dinámico (layout.js).",
            "Optimización de videos del avatar (reducción del 70% en peso).",
            "Estética Glassmorphism Premium consistente.",
            "Saneamiento de assets e imágenes redundantes."
        ]
    },
    {
        "version": "v1.0",
        "title": "Lanzamiento Inicial",
        "date": "22 de Enero, 2026",
        "changes": [
            "Chatbot inteligente GEMA con Gemini AI.",
            "Integración nativa con Make.com.",
            "Avatar interactivo basado en video.",
            "Documentación técnica E01 y E02."
        ]
    }
]