[
    {
        "version": "v1.4",
        "title": "Evolución Estructural, Identidad y Entregables Dinámicos",
        "date": "24 de Enero, 2026",
        "changes": [
            "Reingeniería del Sidebar: Arquitectura modular de 3 bloques (Header, Nav, Footer).",
            "Navegación Inteligente: Ruteo proactivo y numeración dinámica automática (Padre <=> Hijo).",
            "Identidad Facultad X: Desvinculación institucional y personalización del branding global.",
            "Restauración de Avatar Premium: Recuperación del video interactivo GEMA dinámico.",
            "Motor de Entregables Dinámicos: Generación en tiempo real de PDF Fase 1 y 2 con estética académica clásica e inyección de avatar.",
            "Registro de Protocolos de Agente: Implementación de comandos OK versiona, OK guarda y flujo de memoria técnica.",
            "Saneamiento de Repositorio: Consolidación de historial en ZIP y eliminación de redundancias técnicas."
        ]
    },
    {
        "version": "v1.3",
        "title": "UX Premium, PDF y Memoria Histórica",
        "date": "24 (mediodía) de Enero, 2026",
        "changes": [
            "Implementación de Numeración Dinámica Inteligente (Menú <=> Contenidos).",
            "Navegación Proactiva: Redirección automática al primer hijo en categorías padre.",
            "Arquitectura de Sidebar Flex-3-Bloques con Sticky Footer y Scroll Independiente.",
            "Integración de Sistema de Exportación PDF (html2pdf.js) en todos los reportes.",
            "Optimización GEMA: Debouncing de animaciones (400ms) y Avatar premium (100px).",
            "Protocolo de Memoria Técnica organizado por Versiones (data/memoria/vX.Y/)."
        ]
    },
    {
        "version": "v1.2",
        "title": "Arquitectura de Datos Dinámica",
        "date": "24 de Enero, 2026",
        "changes": [
            "Externalización del historial de versiones a un archivo JSON independiente.",
            "Implementación de carga asíncrona (Fetch API) para mayor eficiencia.",
            "Optimización del sistema de navegación global dinámico.",
            "Detección automática de la versión más reciente desde el JSON.",
            "Sistema de cache-busting dinámico para garantizar datos frescos.",
            "Mejora en la mantenibilidad del portal dtic-GEMA."
        ]
    },
    {
        "version": "v1.1",
        "title": "Unificación y Optimización",
        "date": "23 de Enero, 2026",
        "changes": [
            "Unificación de portales (Chatbot + Entregables).",
            "Sistema de navegación dinámico (layout.js).",
            "Optimización de videos del avatar (reducción del 70% en peso).",
            "Estética Glassmorphism Premium consistente.",
            "Saneamiento de assets e imágenes redundantes."
        ]
    },
    {
        "version": "v1.0",
        "title": "Lanzamiento Inicial",
        "date": "22 de Enero, 2026",
        "changes": [
            "Chatbot inteligente GEMA con Gemini AI.",
            "Integración nativa con Make.com.",
            "Avatar interactivo basado en video.",
            "Documentación técnica E01 y E02."
        ]
    }
]