{
    "consignas": {
        "title": "Consignas",
        "subtitle": "Diplomatura en IA para No Programadores",
        "content": [
            {
                "id": "intro",
                "type": "section",
                "title": "Bienvenido al Trabajo Práctico Final",
                "body": "En esta sección encontrarás las bases, objetivos y criterios de evaluación para el desarrollo de tu proyecto integrador. Navega por las sub-secciones para ver los detalles técnicos solicitados."
            },
            {
                "id": "objetivo",
                "type": "section",
                "title": "Objetivo General",
                "body": "Integrar los conocimientos adquiridos sobre herramientas No-Code (Make), Inteligencia Artificial Generativa y metodologías de relevamiento de procesos para desarrollar un Producto Mínimo Viable (MVP) que resuelva una problemática real de negocio o personal mediante la automatización. El objetivo es pasar de la identificación de un 'punto de dolor' a una solución funcional (Quick Win) sin escribir código tradicional."
            },
            {
                "id": "estructura",
                "type": "section",
                "title": "Estructura del Trabajo",
                "body": "El proceso se divide en dos fases fundamentales que guían desde el problema hasta la solución:",
                "blocks": [
                    {
                        "type": "highlight",
                        "title": "FASE 1: Relevamiento y Análisis del proceso a mejorar",
                        "body": "Relevamiento de procesos e identificación de Puntos de Dolor, priorización y selección del Quick Win, y diseño del flujo de la solución."
                    },
                    {
                        "type": "highlight",
                        "title": "FASE 2: Diseño e implementación de la solución No Code",
                        "body": "Elaboración de la ficha técnica (Trigger, Frecuencia, Nodos) y construcción del escenario funcional en Make.com."
                    }
                ]
            },
            {
                "id": "evaluacion",
                "type": "section",
                "title": "Criterios de Evaluación",
                "table": {
                    "headers": [
                        "Pilar Conceptual",
                        "Peso",
                        "Criterio de Evaluación"
                    ],
                    "rows": [
                        [
                            "Selección de Quick Win",
                            "20%",
                            "Capacidad para identificar un verdadero Quick Win. Se valorará que el proceso aporte valor real."
                        ],
                        [
                            "Diseño del Flujo",
                            "30%",
                            "Claridad en la definición de Inputs y Outputs. Correcta aplicación de la lógica."
                        ],
                        [
                            "Implementación Técnica",
                            "30%",
                            "Correcta conexión de módulos, mapeo de datos y ejecución sin errores."
                        ],
                        [
                            "Uso de IA Generativa",
                            "20%",
                            "Integración con sentido dentro del flujo y calidad del prompt implícito."
                        ]
                    ]
                }
            },
            {
                "id": "tips",
                "type": "section",
                "title": "Tips para el éxito",
                "list": [
                    "<strong>Menos es más:</strong> Recuerda el concepto de MVP. Es preferible una automatización pequeña (3 o 4 nodos) que funcione perfectamente.",
                    "<strong>Apóyate en la IA:</strong> Utiliza ChatGPT o Gemini como Asistente de Desarrollo para resolver errores JSON o configurar módulos.",
                    "<strong>No Code, pero SÍ Lógica:</strong> Asegúrate de entender la lógica de los datos que fluyen de un módulo a otro."
                ]
            },
            {
                "type": "footer_action",
                "text": "Este contenido refleja fielmente el documento original de las consignas. Puedes descargarlo aquí:",
                "link": "assets/docs/consigna_tp.pdf",
                "label": "Descargar PDF Original",
                "icon": "external-link",
                "target": "_blank"
            }
        ]
    },
    "fase1": {
        "title": "FASE 1: Relevamiento",
        "subtitle": "Identificación de Puntos de Dolor y Diseño del Flujo",
        "studentInfo": {
            "alumno": "Lic. Ricardo MONLA",
            "area": "Dirección de TIC - Facultad X",
            "fecha": "26 de enero de 2026",
            "proyecto": "dtic-GEMA Integrador"
        },
        "content": [
            {
                "id": "intro_f1",
                "type": "section",
                "title": "Introducción al Relevamiento",
                "body": "La Fase 1 se centra en el diagnóstico situacional y la identificación de oportunidades de mejora mediante automatización. Aquí se detallan los 'puntos de dolor' detectados en la Dirección de TIC."
            },
            {
                "id": "contexto",
                "type": "section",
                "title": "Contexto Institucional",
                "body": "La Dirección de TIC de la Facultad X es el área encargada de la infraestructura, sistemas y soporte técnico de la institución. Cabe destacar que, debido a la estructura actual, la mayor parte de estas tareas son llevadas a cabo por un solo integrante, lo que genera una carga operativa crítica al tener que equilibrar el mantenimiento de servidores, redes y el soporte directo a usuarios."
            },
            {
                "id": "dolores",
                "type": "section",
                "title": "Identificación de Puntos de Dolor",
                "blocks": [
                    {
                        "type": "highlight",
                        "title": "Punto de Dolor 1: Gestión de Accesos (Moodle)",
                        "body": "Alumnos y docentes informan dificultades constantes para matricularse o pérdida de accesos en el Campus Virtual. Carga operativa excesiva para verificar matriculaciones manuales y blanquear contraseñas. Aproximadamente 20 tickets diarios que consumen de 10 a 15 min por ticket, sumando casi 4 horas de trabajo manual diario."
                    },
                    {
                        "type": "highlight",
                        "title": "Punto de Dolor 2: Soporte a la Preinscripción",
                        "body": "Postulantes bloqueados por datos preexistentes o usuarios olvidados en el sistema académico. Requiere una validación de identidad (DNI+Email) constante antes de cualquier acción técnica."
                    },
                    {
                        "type": "highlight",
                        "title": "Punto de Dolor 3: Administración de Servidores",
                        "body": "El monitoreo manual de logs, backups y el control de soluciones técnicas en servidores compite directamente con el tiempo de soporte, creando cuellos de botella en tareas críticas de infraestructura."
                    }
                ]
            },
            {
                "id": "priorizacion",
                "type": "section",
                "title": "Priorización del Quick Win",
                "table": {
                    "headers": [
                        "Punto de Dolor",
                        "Impacto",
                        "Esfuerzo",
                        "Volumen",
                        "Decisión"
                    ],
                    "rows": [
                        [
                            "Gestión de Consultas",
                            "Alto",
                            "Bajo",
                            "Alto",
                            "<strong style='color: #4facfe;'>Seleccionado (Quick Win)</strong>"
                        ],
                        [
                            "Bitácora de Tareas",
                            "Medio",
                            "Bajo",
                            "Medio",
                            "Tarea Interna"
                        ],
                        [
                            "Admin. de Servidores",
                            "Alto",
                            "Alto",
                            "Medio",
                            "Tarea Crítica"
                        ]
                    ]
                },
                "footer_motto": "* Justificación: Automatizar el 80% de las dudas recurrentes permite recuperar casi 4 horas diarias de productividad técnica para enfocarse en la infraestructura."
            },
            {
                "id": "flujo",
                "type": "section",
                "title": "Diseño del Flujo (Lenguaje Natural)",
                "list": [
                    "<strong>Input (Entrada):</strong> El usuario ingresa su Email institucional y DNI en la Interfaz Chatbot Web.",
                    "<strong>Process (Proceso):</strong> <ul><li>Validación de identidad en base de datos <code>dtic-GEMA_BD</code>.</li><li>Clasificación de perfiles y urgencia mediante IA Gemini.</li><li>Categorización inteligente del problema (Acceso Campus, Preinscripción, etc.).</li><li>Generación de 'Dato de Valor' personalizado.</li></ul>",
                    "<strong>Output (Salida):</strong> Número de ticket único, registro persistente en Google Sheets y respuesta humanizada inmediata."
                ],
                "body": "<strong>Herramientas involucradas:</strong> Make, Gemini 1.5 Flash, Google Sheets, Vanilla JS/CSS."
            }
        ]
    },
    "fase2": {
        "title": "FASE 2: Diseño",
        "subtitle": "Configuración Técnica y Lógica de Automatización",
        "content": [
            {
                "id": "intro_f2",
                "type": "section",
                "title": "Introducción a la Implementación",
                "body": "La Fase 2 detalla la construcción técnica del MVP en Make.com, incluyendo la configuración de nodos, la estrategia de prompts y los resultados obtenidos."
            },
            {
                "id": "tecnico",
                "type": "section",
                "title": "Arquitectura de 3 Capas: dtic-GEMA_Make",
                "subtitle": "Ecosistema de Interacción, Mediación y Automatización",
                "body": "La arquitectura del ecosistema dtic-GEMA_Make se organiza en tres niveles jerárquicos que permiten una gestión modular y escalable de los requerimientos técnicos:",
                "list": [
                    "<strong>CAPA 1: Interacción Humana (UX):</strong> El nivel superior donde el usuario final (docente, alumno o agente) presenta su consulta a través de la interfaz web, iniciando el ciclo de asistencia.",
                    "<strong>CAPA 2: Mediación (Portal dtic-GEMA):</strong> El puente inteligente que actúa como traductor entre la necesidad humana y la lógica de datos, encapsulando la seguridad y la transferencia hacia la nube.",
                    "<strong>CAPA 3: Automatización (Make.com):</strong> El motor de ejecución donde residen los nodos lógicos que procesan la información y generan la solución."
                ]
            },
            {
                "type": "image",
                "src": "assets/img/ciclo_oficial_v1.6.4.png",
                "caption": "Arquitectura Oficial dtic-GEMA: Mapa del ecosistema por capas."
            },
            {
                "id": "ingenieriaNodes",
                "type": "section",
                "title": "Ingeniería del Motor de Automatización",
                "subtitle": "Detalle de Nodos y Flujo de Eficiencia en Make",
                "body": "La implementación de esta arquitectura no solo es una mejora técnica, sino un cambio en la calidad del servicio. El flujo se divide en seis hitos críticos coordinados en el escenario:",
                "list": [
                    "<strong>1. Receptor (Webhook):</strong> Captura instantánea del payload JSON desde el Portal sin intermediarios.",
                    "<strong>2. Validador (Search Rows):</strong> Filtro de seguridad que verifica la identidad en la base de datos para asegurar soporte premium.",
                    "<strong>3. Derivador (Router):</strong> El centro lógico que bifurca el flujo mediante lógica condicional determinista.",
                    "<strong>4. IA Gemini (Gemini AI):</strong> Gemini 1.5 Flash transforma datos crudos en soluciones empáticas y precisas.",
                    "<strong>5. Escriba (Add Row):</strong> Nada se pierde; cada interacción queda guardada para auditoría y mejora continua.",
                    "<strong>6. Responder (Webhook Response):</strong> Cierre de ciclo e inyección inmediata de la solución en la pantalla del usuario."
                ]
            },
            {
                "id": "ia",
                "type": "section",
                "title": "Implementación de IA Generativa",
                "subtitle": "Estrategia de Prompts y Orquestación",
                "body": "Se utiliza un orquestador que inyecta el rol del asistente, reglas de seguridad y SLAs diferenciados.",
                "code": "// System Prompt de GEMA\\nEres dtic-GEMA_FRLR, el Asistente Inteligente de la Dirección de TIC. Asiste con tono profesional y empático.\\n1. Validación: Siempre valida identidad contra {{agentes}}.\\n2. Priorización: SLA Autoridades < 2hs / Otros < 24hs.\\n3. Seguridad: NUNCA pidas contraseñas.\\n4. Valor: Inyecta un dato curioso sobre la carrera del usuario."
            }
        ]
    },
    "entregables": {
        "title": "Entregables",
        "subtitle": "Gestión de Requerimientos y Historial de Versiones",
        "content": [
            {
                "id": "intro_entregas",
                "type": "section",
                "title": "Cierre de Proyecto y Archivos",
                "body": "En esta sección se consolidan los documentos finales para la aprobación del TFI y el acceso al historial de entregas."
            },
            {
                "id": "generacion",
                "type": "section",
                "title": "Generación de Entregables",
                "body": "Utiliza este portal para acceder a los documentos oficiales actualizados con la estética académica requerida.",
                "blocks": [
                    {
                        "type": "action_item",
                        "title": "PDF Fase 1: Relevamiento",
                        "body": "Informe de procesos y puntos de dolor detectados (Versión Estática).",
                        "action": {
                            "label": "Descargar PDF Fase 1",
                            "link": "assets/docs/dtic-GEMA_v1.5_Entregable1_20260126_1754.pdf",
                            "icon": "file-down",
                            "target": "_blank"
                        }
                    },
                    {
                        "type": "action_item",
                        "title": "PDF Fase 2: Diseño",
                        "body": "Ficha técnica y lógica de implementación IA (Versión Estática).",
                        "action": {
                            "label": "Descargar PDF Fase 2",
                            "link": "assets/docs/dtic-GEMA_v1.5_Entregable2_20260126_1754.pdf",
                            "icon": "file-down",
                            "target": "_blank"
                        }
                    },
                    {
                        "type": "action_item",
                        "title": "Blueprint: Arquitectura Make",
                        "body": "Accede al archivo JSON descargado de Make.com (Debe residir en assets/docs/blueprint.json).",
                        "action": {
                            "label": "Descargar Blueprint",
                            "link": "assets/docs/blueprint.json",
                            "icon": "code",
                            "target": "_blank"
                        }
                    }
                ]
            },
            {
                "id": "historial",
                "type": "section",
                "title": "Historial Consolidado",
                "body": "Acceso al respaldo de la entrega oficial inicial.",
                "footer_action": {
                    "text": "Entrega unificada (Hito del 22/01/2026):",
                    "link": "../data/entregas/260122_entrega_completa.zip",
                    "label": "Descargar ZIP Histórico",
                    "icon": "archive",
                    "target": "_blank"
                }
            }
        ]
    }
}